In [ ]:
import pymysql as msql
import pandas as pd

### pymysql.connect()方法参数
- host – Host where the database server is located
- user – Username to log in as
- password (passwd) – Password to use.
- database (db) – Database to use, None to not use a particular one.
- port – MySQL port to use, default is usually OK. (default: 3306)
- bind_address – When the client has multiple network interfaces, specify the interface from which to connect to the host. Argument can be a hostname or an IP address.
- charset – Charset you want to use.
- sql_mode – Default SQL_MODE to use.
- use_unicode – Whether or not to default to unicode strings. This option defaults to true for Py3k.
- cursorclass – Custom cursor class to use. default: list, or DictCusor
- connect_timeout – Timeout before throwing an exception when connecting. (default: 10, min: 1, max: 31536000)
- read_default_group – Group to read from in the configuration file.
- autocommit – Autocommit mode. None means use server default. (default: False)
- local_infile – Boolean to enable the use of LOAD DATA LOCAL command. (default: False)
- max_allowed_packet – Max size of packet sent to server in bytes. (default: 16MB) Only used to limit size of “LOAD LOCAL INFILE” data packet smaller than default (16KB).
- defer_connect – Don’t explicitly connect on contruction - wait for connect call. (default: False)

In [ ]:
configs = {'host': 'localhost',
          'port': 3306,
          'user': 'root',
          'password': 'xiaoyu1986',
          'db': 'university'}
          #'cursorclass': msql.cursors.DictCursor}  # cusorclass参数可不提供，此时返回列表查询结果

In [ ]:
conn = msql.connect(**configs)  # 等价于 msql.connect('localhost', 'root', 'xiaoyu1986', 'univeristy', 3306)

### connect对象的方法

- autocommit_mode = None.
    specified autocommit mode. None means use server default.

- begin().
    Begin transaction.

- close().
    Send the quit message and close the socket

- commit().
    Commit changes to stable storage

- cursor(cursor=None).
    Create a new cursor to execute queries with

- ping(reconnect=True).
    Check if the server is alive
    
- rollback().
    Roll back the current transaction

- select_db(db).
    Set current db

- show_warnings().
    SHOW WARNINGS

In [ ]:
conn.select_db('temple')  # 变更当前数据库

In [ ]:
conn.show_warnings()  # 提示信息

### cursor对象

- callproc(procname, args=()).
    - Execute stored procedure procname with args
    - procname – string, name of procedure to execute on server
    - args – Sequence of parameters to use with procedure
    - Returns the original args.

- close()
    - Closing a cursor just exhausts all remaining data.
 
- execute(query, args=None)
    - Execute a query
    - Parameters:	
        query (str) – Query to execute.
        args (tuple, list or dict) – parameters used with query. (optional)
    - Returns: Number of affected rows
    - Return type: int
    - If args is a list or tuple, %s can be used as a placeholder in the query. If args is a dict, %(name)s can be used as a placeholder in the query.
    
- executemany(query, args)
    - Run several data against one query
    - Parameters:	
        - query – query to execute on server
        - args – Sequence of sequences or mappings. It is used as parameter.
    - Returns:	
        - Number of rows affected, if any.   
    - This method improves performance on multiple-row INSERT and REPLACE. Otherwise it is equivalent to looping over args with execute().   
- fetchall()
    - Fetch all the rows
- fetchmany(size=None)
    - Fetch several rows
- fetchone()
    - Fetch the next row
- max_stmt_length = 1024000
    - Max statement size which executemany() generates.
    - Max size of allowed statement is max_allowed_packet - packet_header_size. Default value of max_allowed_packet is 1048576.

In [ ]:
cursor = conn.cursor()  # 通过connect对象创建一个cursor对象

In [ ]:
cursor.execute('select database()')

In [ ]:
print cursor.fetchall()

### 创建表

- table_name: t1
- columns: id, name

In [ ]:
cursor.execute("CREATE TABLE `t1`(`id` int(5) primary key, `name` varchar(20))")  # 创建t1表

In [ ]:
conn.commit()

### 修改表
- 增加两个属性 gender, depart_no

In [ ]:
cursor = conn.cursor(cursor=msql.cursors.DictCursor)

In [ ]:
cursor.execute("show columns from t1")
print [(x['Field'], x['Type'], x['Key']) for x in cursor.fetchall()]

In [ ]:
cursor.execute("ALTER TABLE `t1` ADD `gender` char(1), ADD `depart_no` char(5)")

### 插入单行.execute()

In [ ]:
sql = "INSERT INTO `t1`(`id`, `name`) values (%s, %s)"
cursor.execute(sql, (1, 'HH'))  # 参数化查询
cursor.execute(sql, ('2', 'LC'))  # 类型自动转换
cursor.execute(sql % (3, "'LL'"))  # 字符串拼接 sql%('1', 'HH'), 注意最后拼接成的字符串与mysql中的语法一致

In [ ]:
sql_1 = "INSERT INTO `t1`(`id`, `name`) values (:0, :1)"  # 参数化查询：占位符的另一种写法
cursor.execute(sql, (4, 'HX'))

In [ ]:
sql_2 = "INSERT INTO `t1`(`id`, `name`) values ({0}, {1})"  # 新型字符串格式化1
cursor.execute(sql_2.format(repr(5), repr('DC')))

In [ ]:
sql_3 = "INSERT INTO `t1`(`id`, `name`) values ({id}, {name})" # 新型字符串格式化2
cursor.execute(sql_3.format(id=repr(6), name=repr('LL')))

### 插入多行.executemany()

In [ ]:
ins_list = [(7, 'HX'), (8, 'GC')]
cursor.executemany(sql, ins_list)

In [ ]:
conn.commit()

### 查询（返回1行或多行结果）

In [ ]:
cursor = conn.cursor(cursor=msql.cursors.DictCursor)  # DictCursor返回的查询结果为字典

In [ ]:
cursor.execute("SELECT `id`, `name` FROM `t1`")
cursor.rowcount  # 返回execute()方法影响的行数

In [ ]:
r1 = cursor.fetchone()
print r1

- 移动游标cursor.scroll()
    - cursor.scroll(-1, mode='relative') # 相对当前位置移动
    - cursor.scroll(1, mode='absolute') # 相对绝对位置移动

In [ ]:
cursor.scroll(0, mode='absolute') # 相对绝对位置移动, 初始位置为0
for i, x in enumerate(cursor.fetchall()):
    print i, x

### 更新表

In [ ]:
sql = """UPDATE `t1`
         SET `gender`='1', `depart_no`='10001'
         WHERE `id`=1
      """

cursor.execute(sql)

In [ ]:
cursor.execute("SELECT `id`, `name`, `gender` FROM `t1` WHERE `id`=1")

In [ ]:
#cursor.scroll(-1, mode='relative')
cursor.fetchone()

- cursor.description获取查询结果字段信息

In [ ]:
cursor.description

### 删除表

In [ ]:
cursor.execute("DROP TABLE `t1`")

# 案例：构建university数据库中的表结构，并输入实例数据

In [ ]:
conn.select_db('progrm')

In [ ]:
def table_struc(sql, conn=conn):
    with conn.cursor() as cursor:
        cursor.execute(sql)
        conn.commit()

In [ ]:
def insert_data(sql, data, conn=conn):
    try:
        with conn.cursor() as cursor:
            cursor.executemany(sql, data)
            conn.commit()
    
    except Exception, e:
        print e
        conn.rollback()

### 1. classroom表

In [ ]:
with conn.cursor() as cursor:
    sql = """create table `classroom`(
                           `building` varchar(15),
                           `room_number` varchar(7),
                           `capacity` decimal(4, 0),
                            primary key (`building`, `room_number`))
          """

    cursor.execute(sql)
    conn.commit()

In [ ]:
data = [('Packard', '101', '500'),
       ('Painter', '514', '10'),
       ('Taylor', '3128', '70'),
       ('Watson', '100', '30'),
       ('Watson', '120', '50')]

In [ ]:
try:
    with conn.cursor() as cursor:
        sql = "INSERT INTO `classroom` (`building`, `room_number`, `capacity`) VALUES (%s, %s, %s)"
        for x in data:  # cursor.executemany(sql, data)
            cursor.execute(sql, x)

        conn.commit()
        
except:
    conn.rollback()

### 2. department表

In [ ]:
sql = """create table `department`(
                                `dept_name` varchar(20) primary key,
                                `building` varchar(15),
                                `budget` decimal(12, 2));"""

table_struc(sql)

In [ ]:
data = [('Biology', 'Watson', '90000'), 
        ('Comp. Sci.', 'Taylor', '100000'),
        ('Elec. Eng.', 'Taylor', '85000'), 
        ('Finance', 'Painter', '120000'),
        ('History', 'Painter', '50000'), 
        ('Music', 'Packward', '80000'),
        ('Physics', 'Watson', '70000')]

sql = "INSERT INTO `department` (`dept_name`, `building`, `budget`) VALUES (%s, %s, %s)"

insert_data(sql, data)

In [ ]:
with conn.cursor() as cursor:
    cursor.execute("update department set dept_name = 'Comp. Sci.' where dept_name = 'Comp. Sci'")
    conn.commit()

In [ ]:
with conn.cursor() as cursor:
    sql = "SELECT `*` FROM `department` WHERE `building`=%s"
    cursor.execute(sql, 'Taylor')
    result = cursor.fetchone()
    print result

### 3. instructor表

In [ ]:
sql = """create table `instructor`(
                            `ID` varchar(5) primary key,
                            `name` varchar(20),
                            `dept_name` varchar(20),
                            `salary` decimal(8,2),
                             foreign key (dept_name) references department (dept_name));
      """

table_struc(sql)

In [ ]:
data = [('10101', 'Srinivasan', 'Comp. Sci.', '65000'),
       ('12121', 'Wu', 'Finance', '90000'),
       ('15151', 'Mozart', 'Music', '40000'),
       ('22222', 'Einstein', 'Physics', '95000'),
       ('32343', 'EI Said', 'History', '60000'),
       ('33456', 'Gold', 'Physics', '87000'),
       ('45565', 'Katz', 'Comp. Sci.', '75000'),
       ('58583', 'Califieri', 'History', '62000'),
       ('76766', 'Crick', 'Biology', '72000'),
       ('76543', 'Singh', 'Finance', '80000'),
       ('83821', 'Brandt', 'Comp. Sci.', '92000'),
       ('98345', 'Kim', 'Elec. Eng.', '80000')]

sql = "INSERT INTO `instructor` (`ID`, `name`, `dept_name`, `salary`) VALUES (%s, %s, %s, %s)"
insert_data(sql, data)

### 4. course表

In [ ]:
sql = """create table `course`(
                        `course_id` varchar(7) primary key,
                        `title` varchar(50),
                        `dept_name` varchar(20),
                        `credits` decimal(2,0),
                        foreign key (`dept_name`) references `department`(`dept_name`))"""

table_struc(sql)

In [ ]:
data = [('BIO-101', 'Intro. to Biology', 'Biology', '4'),
       ('BIO-301', 'Genetics', 'Biology', '4'),
       ('BIO-399', 'Computational Biology', 'Biology', '3'),
       ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', '4'),
       ('CS-190', 'Game Design', 'Comp. Sci.', '4'),
       ('CS-315', 'Robotics', 'Comp. Sci.', '3'),
       ('CS-319', 'Image Processing', 'Comp. Sci.', '3'),
       ('CS-347', 'Database System Concepts', 'Comp. Sci.', '3'),
       ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', '3'),
       ('FIN-201', 'Investment Banking', 'Finance', '3'),
       ('HIS-351', 'World History', 'History', '3'),
       ('MU-199', 'Music Video Production', 'Music', '3'),
       ('PHY-101', 'Physical Principles', 'Physics', '4')]

sql = "INSERT INTO `course` (`course_id`, `title`, `dept_name`, `credits`) VALUES (%s, %s, %s, %s)"

insert_data(sql, data)

### 5. section表

In [ ]:
sql = """create table `section`(
                         `course_id` varchar(7),
                         `sec_id` varchar(8),
                         `semester` varchar(6),
                         `year` decimal(4,0),
                         `building` varchar(15),
                         `room_number` varchar(7),
                         `time_slot_id` varchar(4),
                         primary key (`course_id`, `sec_id`, `semester`, `year`),
                         foreign key (`course_id`) references `course`(`course_id`))
       """

table_struc(sql)

In [ ]:
data = [('BIO-101', '1', 'Summer', '2009', 'Painter', '514', 'B'),
       ('BIO-301', '1', 'Summer', '2010', 'Painter', '514', 'A'),
       ('CS-101', '1', 'Fall', '2009', 'Packard', '101', 'H'),
       ('CS-101', '1', 'Spring', '2010', 'Packard', '101', 'F'),
       ('CS-190', '1', 'Spring', '2009', 'Taylor', '3128', 'E'),
       ('CS-190', '2', 'Spring', '2009', 'Taylor', '3128', 'A'),
       ('CS-315', '1', 'Spring', '2010', 'Watson', '120', 'D'),
       ('CS-319', '1', 'Spring', '2010', 'Watson', '100', 'B'),
       ('CS-319', '2', 'Spring', '2010', 'Taylor', '3128', 'C'),
       ('CS-347', '1', 'Fall', '2009', 'Taylor', '3128', 'A'),
       ('EE-181', '1', 'Spring', '2009', 'Taylor', '3128', 'C'),
       ('FIN-201', '1', 'Spring', '2010', 'Packard', '101', 'B'),
       ('HIS-351', '1', 'Spring', '2010', 'Painter', '514', 'C'),
       ('MU-199', '1', 'Spring', '2010', 'Packard', '101', 'D'),
       ('PHY-101', '1', 'Fall', '2009', 'Watson', '100', 'A')
       ]

sql = """INSERT INTO `section` (`course_id`, `sec_id`, `semester`, `year`, `building`, `room_number`, `time_slot_id`) 
                    VALUES (%s, %s, %s, %s, %s, %s, %s)"""

insert_data(sql, data)

### 6. teaches表

In [ ]:
sql = """create table `teaches`(
                         `ID` varchar(5),
                         `course_id` varchar(7),
                         `sec_id` varchar(8),
                         `semester` varchar(6),
                         `year` decimal(4,0),
                         primary key (`ID`, `course_id`, `sec_id`, `semester`, `year`),
                         foreign key (`ID`) references `instructor`(`ID`),
                         foreign key (`course_id`, `sec_id`, `semester`, `year`) references 
                                         `section`(`course_id`, `sec_id`, `semester`, `year`))
                         """

table_struc(sql)

In [ ]:
data = [('10101', 'CS-101', '1', 'Fall', '2009'),
        ('10101', 'CS-315', '1', 'Spring', '2010'),
        ('10101', 'CS-347', '1', 'Fall', '2009'),
        ('12121', 'FIN-201', '1', 'Spring', '2010'),
        ('15151', 'MU-199', '1', 'Spring', '2010'),
        ('22222', 'PHY-101', '1', 'Fall', '2009'),
        ('32343', 'HIS-351', '1', 'Spring', '2010'),
        ('45565', 'CS-101', '1', 'Spring', '2010'),
        ('45565', 'CS-319', '1', 'Spring', '2010'),
        ('76766', 'BIO-101', '1', 'Summer', '2009'),
        ('76766', 'BIO-301', '1', 'Summer', '2010'),
        ('83821', 'CS-190', '1', 'Spring', '2009'),
        ('83821', 'CS-190', '2', 'Spring', '2009'),
        ('83821', 'CS-319', '2', 'Spring', '2010'),
        ('98345', 'EE-181', '1', 'Spring', '2009')
       ]

sql = """INSERT INTO `teaches` (`ID`, `course_id`, `sec_id`, `semester`, `year`) 
                    VALUES (%s, %s, %s, %s, %s)"""

insert_data(sql, data)

### 7. prereq表

In [ ]:
sql = """create table `prereq`(
                        `course_id` varchar(7) primary key,
                        `prereq_id` varchar(7),
                        foreign key (`prereq_id`) references `course`(`course_id`))
          """

table_struc(sql)

In [ ]:
data = [('BIO-301', 'BIO-101'),
       ('BIO-399', 'BIO-101'),
       ('CS-190', 'CS-101'),
       ('CS-315', 'CS-101'),
       ('CS-319', 'CS-101'),
       ('CS-347', 'CS-101'),
       ('EE-181', 'PHY-101')]

sql = "INSERT INTO `prereq` (`course_id`, `prereq_id`) VALUES (%s, %s)"
insert_data(sql, data)

### 8. student表

In [ ]:
sql = """create table `student`(
                         `ID` varchar(5) primary key,
                         `name` varchar(20) not null,
                         `dept_name` varchar(20),
                         `tot_cred` decimal(3, 0) check (tot_cred >= 0),
                         foreign key (`dept_name`) references `department` (`dept_name`) on delete set null)
                         """
table_struc(sql)

In [ ]:
data = [('00128', 'Zhang', 'Comp. Sci.', '102'),
       ('12345', 'Shankar', 'Comp. Sci.', '32'),
       ('19991', 'Brandt', 'History', '80'),
       ('23121', 'Chavez', 'Finance', '110'),
       ('44553', 'Peltier', 'Physics', '56'),
       ('45678', 'Levy', 'Physics', '46'),
       ('54321', 'Williams', 'Comp. Sci.', '54'),
       ('55739', 'Sanchez', 'Music', '38'),
       ('70557', 'Snow', 'Physics', '0'),
       ('76543', 'Brown', 'Comp. Sci.', '58'),
       ('76653', 'Aoi', 'Elec. Eng.', '60'),
       ('98765', 'Bourikas', 'Elec. Eng.', '98'),
       ('98988', 'Tanaka', 'Biology', '120')]

sql = "INSERT INTO `student` (`ID`, `name`, `dept_name`, `tot_cred`) VALUES (%s, %s, %s, %s)"
insert_data(sql, data)

### 9. takes表

In [ ]:
sql = """create table `takes`(
                   `ID` varchar(5),
                   `course_id` varchar(7),
                   `sec_id` varchar(8),
                   `semester` varchar(6),
                   `year` decimal(4, 0),
                   `grade` varchar(2),
                   primary key (`ID`, `course_id`, `sec_id`, `semester`, `year`),
                   foreign key (`course_id`, `sec_id`, `semester`, `year`) references 
                                  `section`(`course_id`, `sec_id`, `semester`, `year`) on delete cascade,
                   foreign key (`ID`) references `student`(`ID`) on delete cascade)
      """

table_struc(sql)

In [ ]:
data = [('00128','CS-101','1','Fall','2009','A'),
        ('00128','CS-347','1','Fall','2009','A-'),
        ('12345','CS-101','1','Fall','2009','C'),
        ('12345','CS-190','2','Spring','2009','A'),
        ('12345','CS-315','1','Spring','2010','A'),
        ('12345','CS-347','1','Fall','2009','A'),
        ('19991','HIS-351','1','Spring','2010','B'),
        ('23121','FIN-201','1','Spring','2010','C+'),
        ('44553','PHY-101','1','Fall','2009','B-'),
        ('45678','CS-101','1','Fall','2009','F'),
        ('45678','CS-101','1','Spring','2010','B+'),
        ('45678','CS-319','1','Spring','2010','B'),
        ('54321','CS-101','1','Fall','2009','A-'),
        ('54321','CS-190','2','Spring','2009','B+'),
        ('55739','MU-199','1','Spring','2010','A-'),
        ('76543','CS-101','1','Fall','2009','A'),
        ('76543','CS-319','2','Spring','2010','A'),
        ('76653','EE-181','1','Spring','2009','C'),
        ('98765','CS-101','1','Fall','2009','C-'),
        ('98765','CS-315','1','Spring','2010','B'),
        ('98988','BIO-101','1','Summer','2009','A'),
        ('98988','BIO-301','1','Summer','2010',None)]

sql = "INSERT INTO `takes` (`ID`, `course_id`, `sec_id`, `semester`, `year`, `grade`) VALUES (%s, %s, %s, %s, %s, %s)"
insert_data(sql, data)

### 10. advisor表

In [ ]:
sql = """create table `advisor`(
                     `s_ID` varchar(5) primary key,
                     `i_ID` varchar(5),
                     foreign key (`i_ID`) references `instructor`(`ID`) on delete set null,
                     foreign key (`s_ID`) references `student`(`ID`) on delete cascade)
      """

table_struc(sql)

In [ ]:
data = [('00128','45565'),
       ('12345','10101'),
       ('23121','76543'),
       ('44553','22222'),
       ('45678','22222'),
       ('76543','45565'),
       ('76653','98345'),
       ('98765','98345'),
       ('98988','76766')]

sql = "INSERT INTO `advisor` (`s_ID`, `i_ID`) VALUES (%s, %s)"
insert_data(sql, data)

### timeslot表

In [ ]:
sql = """create table `timeslot`(
                      `time_slot_id` varchar(4),
                      `day` varchar(4) check (day in ('M', 'T', 'W', 'R', 'F', 'S', 'U')),
                      `start_time` time,
                      `end_time` time,
                      primary key (`time_slot_id`, `day`, `start_time`))
      """

table_struc(sql)

In [ ]:
data = [('A','M','8:00','8:50'),
       ('A','W','8:00','8:50'),
       ('A','F','8:00','8:50'),
       ('B','M','9:00','9:50'),
       ('B','W','9:00','9:50'),
       ('B','F','9:00','9:50'),
       ('C','M','11:00','11:50'),
       ('C','W','11:00','11:50'),
       ('C','F','11:00','11:50'),
       ('D','M','13:00','13:50'),
       ('D','W','13:00','13:50'),
       ('D','F','13:00','13:50'),
       ('E','T','10:30','11:45'),
       ('E','R','10:30','11:45'),
       ('F','T','14:30','15:45'),
       ('F','R','14:30','15:45'),
       ('G','M','16:00','16:50'),
       ('G','W','16:00','16:50'),
       ('G','F','16:00','16:50'),
       ('H','W','10:00','12:30')]

sql = "INSERT INTO `timeslot` (`time_slot_id`, `day`, `start_time`, `end_time`) VALUES (%s, %s, %s, %s)"
insert_data(sql, data)

In [ ]:
with conn.cursor() as cursor:
    cursor.call_proc('')
    cursor.execute('call ..')